Ran Plan for dir: `terraform/ap-southeast-1` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.5.3 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/vntechies/013-demo-gitops/7/default/terraform/ap-southeast-1/demo-aws-cloudday-vn-default.tfplan\"" in "/home/atlantis/.atlantis/repos/vntechies/013-demo-gitops/7/default/terraform/ap-southeast-1": exit status 1
module.vpc["demo-vpc"].data.aws_region.current: Reading...
module.vpc["demo-vpc"].data.aws_region.current: Read complete after 0s [id=ap-southeast-1]
module.eks.data.aws_region.current: Reading...
module.eks.data.aws_partition.current: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.eks.aws_iam_role.cluster: Refreshing state... [id=eks-cluster-thodung-vntechies-demo-eks]
module.eks.aws_iam_policy.ebs_csi["aws-ebs-csi-driver"]: Refreshing state... [id=arn:aws:iam::010352592457:policy/thodung-vntechies-demo-eks-ebs-csi]
module.eks.aws_iam_role.node: Refreshing state... [id=eks-node-group-thodung-vntechies-demo-eks]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc["demo-vpc"].aws_vpc.vpc: Refreshing state... [id=vpc-05f67dec3e19597d3]
module.eks.data.aws_region.current: Read complete after 0s [id=ap-southeast-1]
module.vpc["demo-vpc"].aws_internet_gateway.igw[0]: Refreshing state... [id=igw-0d474349bd636d68c]
module.vpc["demo-vpc"].aws_subnet.this["public_subnet3"]: Refreshing state... [id=subnet-0b1743b318f3693ee]
module.vpc["demo-vpc"].aws_subnet.this["public_subnet1"]: Refreshing state... [id=subnet-0cb7fc68240103b1b]
module.vpc["demo-vpc"].aws_subnet.this["public_subnet2"]: Refreshing state... [id=subnet-01183ba54fce29ae7]
module.vpc["demo-vpc"].aws_route_table.this["public_rtb"]: Refreshing state... [id=rtb-01d240c02fb6f1f20]
module.vpc["demo-vpc"].aws_security_group.endpoint: Refreshing state... [id=sg-0618aee9155004a34]
module.vpc["demo-vpc"].aws_route_table_association.this["public_subnet3"]: Refreshing state... [id=rtbassoc-0585bda2a9df2c9e0]
module.vpc["demo-vpc"].aws_route_table_association.this["public_subnet1"]: Refreshing state... [id=rtbassoc-0f53fe4cb204ed857]
module.vpc["demo-vpc"].aws_route_table_association.this["public_subnet2"]: Refreshing state... [id=rtbassoc-0e94b60fd41ea6f9e]
module.vpc["demo-vpc"].aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-01d240c02fb6f1f201080289494]
module.vpc["demo-vpc"].aws_vpc_endpoint.s3: Refreshing state... [id=vpce-05ecb02e9d23abbee]
module.vpc["demo-vpc"].aws_vpc_endpoint.dynamodb: Refreshing state... [id=vpce-0c819eb8e77498f45]
data.aws_subnets.eks_vpc_subnets: Reading...
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=010352592457]
data.aws_subnets.eks_vpc_subnets: Read complete after 0s [id=ap-southeast-1]
module.eks.aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=eks-node-group-thodung-vntechies-demo-eks-20230714145948148500000005]
module.eks.aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=eks-node-group-thodung-vntechies-demo-eks-20230714145947886900000003]
module.eks.aws_iam_role_policy_attachment.AmazonSSMManagedInstanceCore: Refreshing state... [id=eks-node-group-thodung-vntechies-demo-eks-20230714145947863900000001]
module.eks.aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=eks-node-group-thodung-vntechies-demo-eks-20230714145947876100000002]
module.eks.aws_iam_role_policy_attachment.AmazonEKSVPCResourceController: Refreshing state... [id=eks-cluster-thodung-vntechies-demo-eks-20230714145948144200000004]
module.eks.aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=eks-cluster-thodung-vntechies-demo-eks-20230714145948151000000006]
module.eks.aws_eks_cluster.eks: Refreshing state... [id=thodung-vntechies-eks-demo-eks]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::010352592457:oidc-provider/oidc.eks.ap-southeast-1.amazonaws.com/id/1E420E5E377EF7A7868356CCBB541B6D]
data.aws_eks_cluster_auth.eks: Reading...
data.aws_eks_cluster_auth.eks: Read complete after 0s [id=cloud-day-demo-eks-demo-eks]
module.eks.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.eks.aws_eks_node_group.node["workers-1-23"]: Refreshing state... [id=thodung-vntechies-eks-demo-eks:workers-1-23]
module.eks.aws_iam_role.irsa["aws-ebs-csi-driver"]: Refreshing state... [id=aws-ebs-csi-driver]
module.eks.aws_eks_addon.this["cni"]: Refreshing state... [id=thodung-vntechies-eks-demo-eks:vpc-cni]
module.eks.aws_iam_role_policy_attachment.irsa_ebs_csi_policy["aws-ebs-csi-driver"]: Refreshing state... [id=aws-ebs-csi-driver-2023071415072141720000000a]
module.eks.aws_eks_addon.this["aws-ebs-csi-driver"]: Refreshing state... [id=thodung-vntechies-eks-demo-eks:aws-ebs-csi-driver]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_eks_cluster.eks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "eks" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "cloud-day-demo-eks-demo-eks"
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "aws-ebs-csi-driver"
      + id                 = (known after apply)
      + kubernetes_version = "1.25"
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.25"
      + version            = (known after apply)
    }

  # module.eks.data.tls_certificate.this will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] must be replaced
-/+ resource "aws_eks_addon" "this" {
      ~ addon_version            = "v1.20.0-eksbuild.1" -> (known after apply)
      ~ arn                      = "arn:aws:eks:ap-southeast-1:010352592457:addon/thodung-vntechies-eks-demo-eks/aws-ebs-csi-driver/2ac4aa78-9a7f-e344-707e-810a659f1515" -> (known after apply)
      ~ cluster_name             = "thodung-vntechies-eks-demo-eks" -> "cloud-day-demo-eks-demo-eks" # forces replacement
      + configuration_values     = (known after apply)
      ~ created_at               = "2023-07-14T15:07:21Z" -> (known after apply)
      ~ id                       = "thodung-vntechies-eks-demo-eks:aws-ebs-csi-driver" -> (known after apply)
      ~ modified_at              = "2023-07-14T15:22:38Z" -> (known after apply)
      ~ service_account_role_arn = "arn:aws:iam::010352592457:role/aws-ebs-csi-driver" -> (known after apply)
      - tags                     = {
          - "component"   = "thodung"
          - "env"         = "vntechies"
          - "github_repo" = "github.com/vntechies/013-demo-gitops"
          - "project"     = "013-demo-gitops"
        } -> null
      ~ tags_all                 = {
          ~ "component"   = "thodung" -> "cloud-day"
          ~ "env"         = "vntechies" -> "demo"
          ~ "github_repo" = "github.com/vntechies/013-demo-gitops" -> "github.com/tnx-journey-to-cloud/demo-aws-cloudday-vn"
          ~ "project"     = "013-demo-gitops" -> "demo-aws-cloudday-vn"
        }
        # (2 unchanged attributes hidden)
    }

  # module.eks.aws_eks_addon.this["cni"] must be replaced
-/+ resource "aws_eks_addon" "this" {
      ~ addon_version            = "v1.12.2-eksbuild.1" -> (known after apply)
      ~ arn                      = "arn:aws:eks:ap-southeast-1:010352592457:addon/thodung-vntechies-eks-demo-eks/vpc-cni/fec4aa78-9a7c-cc01-391b-3470c9b70d26" -> (known after apply)
      ~ cluster_name             = "thodung-vntechies-eks-demo-eks" -> "cloud-day-demo-eks-demo-eks" # forces replacement
      + configuration_values     = (known after apply)
      ~ created_at               = "2023-07-14T15:07:21Z" -> (known after apply)
      ~ id                       = "thodung-vntechies-eks-demo-eks:vpc-cni" -> (known after apply)
      ~ modified_at              = "2023-07-14T15:07:23Z" -> (known after apply)
      + service_account_role_arn = (known after apply)
      - tags                     = {
          - "component"   = "thodung"
          - "env"         = "vntechies"
          - "github_repo" = "github.com/vntechies/013-demo-gitops"
          - "project"     = "013-demo-gitops"
        } -> null
      ~ tags_all                 = {
          ~ "component"   = "thodung" -> "cloud-day"
          ~ "env"         = "vntechies" -> "demo"
          ~ "github_repo" = "github.com/vntechies/013-demo-gitops" -> "github.com/tnx-journey-to-cloud/demo-aws-cloudday-vn"
          ~ "project"     = "013-demo-gitops" -> "demo-aws-cloudday-vn"
        }
        # (2 unchanged attributes hidden)
    }

  # module.eks.aws_eks_cluster.eks must be replaced
-/+ resource "aws_eks_cluster" "eks" {
      ~ arn                       = "arn:aws:eks:ap-southeast-1:010352592457:cluster/thodung-vntechies-eks-demo-eks" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvakNDQWVhZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJek1EY3hOREUxTURRek5Wb1hEVE16TURjeE1URTFNRFF6TlZvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTXFrCjN4MmhoenMzbzVVZGtSZjBFanlTUDdxWjRlY0REWU1NVFNmc1lKcVh6eVZjejlQVWxPTHVtTGIrelZwVU12THUKYnkxL2EvMExYUzd3SnRmR054QXkvTHZVaSsrT1NQbEJQbWh1KzZPSDNTUlVQbUxSVkJEQWFPcVZ3dU9uSlBxbQozdkd3M3JNUTJZdFhkOGM1Smg2RWg3RzRxc3c0Y3FoQUFmN1RvcWRSM3VWeHN5ekJxUjFhcUQxQ1cvSk8ycGRwCmVQUzVXRmpkazI3MnVoWnlTSG1UNWtDcnBSRFA2MWc2TXdHcWFWblZTQTFBaDIyVVdUeTg5cjF5NFgrMlNkVnoKRWpCeHNrMVJPMGF6bHpJQ0ZZS3B6bUJJVXVPVHllVE9QR25BTDlwVDFIRkk4QjdyZEE3MG0yT1ovWVdVbkt2bQpLalIweVpEL1I0eTZKUDlVYnBrQ0F3RUFBYU5aTUZjd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZPZnJRbFYxT0hCZHlHVG00VkdmektsTEtzUG5NQlVHQTFVZEVRUU8KTUF5Q0NtdDFZbVZ5Ym1WMFpYTXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnRUJBTHltSE5qV0tQbXptNkN2SWVPbgpFS05vMGVFY3JOcENTRi9OejRaNDJDcWRxbisyVEM1NXR3cFB2ZjU2RW5xaWQxWUhEM3lndVdkb1pGZmZlRGNUCnVCeCt4UTlZRlhsTUN2czZ5UG1kWmMxYnNnUWN6ZTdyQVZmUjZIUDd6TG00UGtuN3Bab2hpZ3FrVkRmS3dVS1MKK2NHMnl5cWhVRnR5Y015Y2lBNWJTWVRFWGVRdDRuN3I1bUsxSlFyUnI1Y00vRHJSYU5Dd2o4SUxucE5wQlJjRgpYYlYxRmNvbXM3Ni8zUTB2UnZ6dHpJVEhZSU9lUURQKzJhaEJNaUZHcG0wYzMxZEk0UEErT0t1ZEE5Yk5EWVU2CjBIeGRWajlUQ3Q3MHFKa2tYM2hhRTdtU2dKbWFMcWVKTGpzSGMyakNoSHNFSkdiMVRlSkx1SlFiVm1XNFhhdmQKVmVFPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      + cluster_id                = (known after apply)
      ~ created_at                = "2023-07-14 14:59:50.994 +0000 UTC" -> (known after apply)
      - enabled_cluster_log_types = [] -> null
      ~ endpoint                  = "https://1E420E5E377EF7A7868356CCBB541B6D.gr7.ap-southeast-1.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "thodung-vntechies-eks-demo-eks" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.ap-southeast-1.amazonaws.com/id/1E420E5E377EF7A7868356CCBB541B6D"
                    },
                ]
            },
        ] -> (known after apply)
      ~ name                      = "thodung-vntechies-eks-demo-eks" -> "cloud-day-demo-eks-demo-eks" # forces replacement
      ~ platform_version          = "eks.5" -> (known after apply)
      ~ role_arn                  = "arn:aws:iam::010352592457:role/eks-cluster-thodung-vntechies-demo-eks" # forces replacement -> (known after apply) # forces replacement
      ~ status                    = "ACTIVE" -> (known after apply)
      - tags                      = {
          - "component"   = "thodung"
          - "env"         = "vntechies"
          - "github_repo" = "github.com/vntechies/013-demo-gitops"
          - "project"     = "013-demo-gitops"
        } -> null
      ~ tags_all                  = {
          ~ "component"   = "thodung" -> "cloud-day"
          ~ "env"         = "vntechies" -> "demo"
          ~ "github_repo" = "github.com/vntechies/013-demo-gitops" -> "github.com/tnx-journey-to-cloud/demo-aws-cloudday-vn"
          ~ "project"     = "013-demo-gitops" -> "demo-aws-cloudday-vn"
        }
        # (1 unchanged attribute hidden)

      - kubernetes_network_config {
          - ip_family         = "ipv4" -> null
          - service_ipv4_cidr = "172.20.0.0/16" -> null
        }

      ~ vpc_config {
          ~ cluster_security_group_id = "sg-052d8c23823cd9670" -> (known after apply)
          ~ public_access_cidrs       = [
              - "0.0.0.0/0",
            ] -> (known after apply)
          - security_group_ids        = [] -> null
          ~ vpc_id                    = "vpc-05f67dec3e19597d3" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.eks.aws_eks_node_group.node["workers-1-23"] must be replaced
-/+ resource "aws_eks_node_group" "node" {
      ~ ami_type               = "AL2_x86_64" -> (known after apply)
      ~ arn                    = "arn:aws:eks:ap-southeast-1:010352592457:nodegroup/thodung-vntechies-eks-demo-eks/workers-1-23/acc4aa78-9631-9c47-a904-52ed3dcd77e7" -> (known after apply)
      ~ cluster_name           = "thodung-vntechies-eks-demo-eks" -> "cloud-day-demo-eks-demo-eks" # forces replacement
      ~ disk_size              = 20 -> (known after apply)
      ~ id                     = "thodung-vntechies-eks-demo-eks:workers-1-23" -> (known after apply)
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ node_role_arn          = "arn:aws:iam::010352592457:role/eks-node-group-thodung-vntechies-demo-eks" # forces replacement -> (known after apply) # forces replacement
      ~ release_version        = "1.25.9-20230703" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-workers-1-23-acc4aa78-9631-9c47-a904-52ed3dcd77e7"
                    },
                ]
              - remote_access_security_group_id = ""
            },
        ] -> (known after apply)
      ~ status                 = "ACTIVE" -> (known after apply)
      - tags                   = {
          - "component"   = "thodung"
          - "env"         = "vntechies"
          - "github_repo" = "github.com/vntechies/013-demo-gitops"
          - "project"     = "013-demo-gitops"
        } -> null
      ~ tags_all               = {
          ~ "component"   = "thodung" -> "cloud-day"
          ~ "env"         = "vntechies" -> "demo"
          ~ "github_repo" = "github.com/vntechies/013-demo-gitops" -> "github.com/tnx-journey-to-cloud/demo-aws-cloudday-vn"
          ~ "project"     = "013-demo-gitops" -> "demo-aws-cloudday-vn"
        }
        # (5 unchanged attributes hidden)

      ~ update_config {
          - max_unavailable            = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] must be replaced
-/+ resource "aws_iam_openid_connect_provider" "oidc_provider" {
      ~ arn             = "arn:aws:iam::010352592457:oidc-provider/oidc.eks.ap-southeast-1.amazonaws.com/id/1E420E5E377EF7A7868356CCBB541B6D" -> (known after apply)
      ~ id              = "arn:aws:iam::010352592457:oidc-provider/oidc.eks.ap-southeast-1.amazonaws.com/id/1E420E5E377EF7A7868356CCBB541B6D" -> (known after apply)
      - tags            = {
          - "component"   = "thodung"
          - "env"         = "vntechies"
          - "github_repo" = "github.com/vntechies/013-demo-gitops"
          - "project"     = "013-demo-gitops"
        } -> null
      ~ tags_all        = {
          ~ "component"   = "thodung" -> "cloud-day"
          ~ "env"         = "vntechies" -> "demo"
          ~ "github_repo" = "github.com/vntechies/013-demo-gitops" -> "github.com/tnx-journey-to-cloud/demo-aws-cloudday-vn"
          ~ "project"     = "013-demo-gitops" -> "demo-aws-cloudday-vn"
        }
      ~ thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
          - "06b25927c42a721631c1efd9431e648fa62e1e39",
          - "2ad974a775f73cbdbbd8f5ac3a49255fa8fb1f8c",
          - "30e620af3b44d4a30c0a64d1ecb8713fab02ca9f",
        ] -> (known after apply)
      ~ url             = "oidc.eks.ap-southeast-1.amazonaws.com/id/1E420E5E377EF7A7868356CCBB541B6D" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_policy.ebs_csi["aws-ebs-csi-driver"] must be replaced
-/+ resource "aws_iam_policy" "ebs_csi" {
      ~ arn         = "arn:aws:iam::010352592457:policy/thodung-vntechies-demo-eks-ebs-csi" -> (known after apply)
      ~ id          = "arn:aws:iam::010352592457:policy/thodung-vntechies-demo-eks-ebs-csi" -> (known after apply)
      ~ name        = "thodung-vntechies-demo-eks-ebs-csi" -> "cloud-day-demo-demo-eks-ebs-csi" # forces replacement
      + name_prefix = (known after apply)
      ~ policy_id   = "ANPAQE2IQAZE2EASVTEYP" -> (known after apply)
      - tags        = {
          - "component"   = "thodung"
          - "env"         = "vntechies"
          - "github_repo" = "github.com/vntechies/013-demo-gitops"
          - "project"     = "013-demo-gitops"
        } -> null
      ~ tags_all    = {
          ~ "component"   = "thodung" -> "cloud-day"
          ~ "env"         = "vntechies" -> "demo"
          ~ "github_repo" = "github.com/vntechies/013-demo-gitops" -> "github.com/tnx-journey-to-cloud/demo-aws-cloudday-vn"
          ~ "project"     = "013-demo-gitops" -> "demo-aws-cloudday-vn"
        }
        # (3 unchanged attributes hidden)
    }

  # module.eks.aws_iam_role.cluster must be replaced
-/+ resource "aws_iam_role" "cluster" {
      ~ arn                   = "arn:aws:iam::010352592457:role/eks-cluster-thodung-vntechies-demo-eks" -> (known after apply)
      ~ create_date           = "2023-07-14T14:59:46Z" -> (known after apply)
      ~ id                    = "eks-cluster-thodung-vntechies-demo-eks" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          - "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController",
        ] -> (known after apply)
      ~ name                  = "eks-cluster-thodung-vntechies-demo-eks" -> "eks-cluster-cloud-day-demo-demo-eks" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {
          - "component"   = "thodung"
          - "env"         = "vntechies"
          - "github_repo" = "github.com/vntechies/013-demo-gitops"
          - "project"     = "013-demo-gitops"
        } -> null
      ~ tags_all              = {
          ~ "component"   = "thodung" -> "cloud-day"
          ~ "env"         = "vntechies" -> "demo"
          ~ "github_repo" = "github.com/vntechies/013-demo-gitops" -> "github.com/tnx-journey-to-cloud/demo-aws-cloudday-vn"
          ~ "project"     = "013-demo-gitops" -> "demo-aws-cloudday-vn"
        }
      ~ unique_id             = "AROAQE2IQAZE6AMIH3QRC" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.eks.aws_iam_role.irsa["aws-ebs-csi-driver"] will be updated in-place
  ~ resource "aws_iam_role" "irsa" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - "oidc.eks.ap-southeast-1.amazonaws.com/id/1E420E5E377EF7A7868356CCBB541B6D:aud" = "sts.amazonaws.com"
                              - "oidc.eks.ap-southeast-1.amazonaws.com/id/1E420E5E377EF7A7868356CCBB541B6D:sub" = "system:serviceaccount:kube-system:ebscsi-controller-sa"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::010352592457:oidc-provider/oidc.eks.ap-southeast-1.amazonaws.com/id/1E420E5E377EF7A7868356CCBB541B6D"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "aws-ebs-csi-driver"
        name                  = "aws-ebs-csi-driver"
      ~ tags                  = {
          - "component"   = "thodung" -> null
          - "env"         = "vntechies" -> null
          - "github_repo" = "github.com/vntechies/013-demo-gitops" -> null
          - "project"     = "013-demo-gitops" -> null
        }
      ~ tags_all              = {
          ~ "component"   = "thodung" -> "cloud-day"
          ~ "env"         = "vntechies" -> "demo"
          ~ "github_repo" = "github.com/vntechies/013-demo-gitops" -> "github.com/tnx-journey-to-cloud/demo-aws-cloudday-vn"
          ~ "project"     = "013-demo-gitops" -> "demo-aws-cloudday-vn"
        }
        # (8 unchanged attributes hidden)
    }

  # module.eks.aws_iam_role.node must be replaced
-/+ resource "aws_iam_role" "node" {
      ~ arn                   = "arn:aws:iam::010352592457:role/eks-node-group-thodung-vntechies-demo-eks" -> (known after apply)
      ~ create_date           = "2023-07-14T14:59:46Z" -> (known after apply)
      ~ id                    = "eks-node-group-thodung-vntechies-demo-eks" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly",
          - "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy",
          - "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
          - "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore",
        ] -> (known after apply)
      ~ name                  = "eks-node-group-thodung-vntechies-demo-eks" -> "eks-node-group-cloud-day-demo-demo-eks" # forces replacement
      + name_prefix           = (known after apply)
      - tags                  = {
          - "component"   = "thodung"
          - "env"         = "vntechies"
          - "github_repo" = "github.com/vntechies/013-demo-gitops"
          - "project"     = "013-demo-gitops"
        } -> null
      ~ tags_all              = {
          ~ "component"   = "thodung" -> "cloud-day"
          ~ "env"         = "vntechies" -> "demo"
          ~ "github_repo" = "github.com/vntechies/013-demo-gitops" -> "github.com/tnx-journey-to-cloud/demo-aws-cloudday-vn"
          ~ "project"     = "013-demo-gitops" -> "demo-aws-cloudday-vn"
        }
      ~ unique_id             = "AROAQE2IQAZEVRY3H6L7A" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly must be replaced
-/+ resource "aws_iam_role_policy_attachment" "AmazonEC2ContainerRegistryReadOnly" {
      ~ id         = "eks-node-group-thodung-vntechies-demo-eks-20230714145947876100000002" -> (known after apply)
      ~ role       = "eks-node-group-thodung-vntechies-demo-eks" -> "eks-node-group-cloud-day-demo-demo-eks" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonEKSClusterPolicy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "AmazonEKSClusterPolicy" {
      ~ id         = "eks-cluster-thodung-vntechies-demo-eks-20230714145948151000000006" -> (known after apply)
      ~ role       = "eks-cluster-thodung-vntechies-demo-eks" -> "eks-cluster-cloud-day-demo-demo-eks" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonEKSVPCResourceController must be replaced
-/+ resource "aws_iam_role_policy_attachment" "AmazonEKSVPCResourceController" {
      ~ id         = "eks-cluster-thodung-vntechies-demo-eks-20230714145948144200000004" -> (known after apply)
      ~ role       = "eks-cluster-thodung-vntechies-demo-eks" -> "eks-cluster-cloud-day-demo-demo-eks" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "AmazonEKSWorkerNodePolicy" {
      ~ id         = "eks-node-group-thodung-vntechies-demo-eks-20230714145947886900000003" -> (known after apply)
      ~ role       = "eks-node-group-thodung-vntechies-demo-eks" -> "eks-node-group-cloud-day-demo-demo-eks" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "AmazonEKS_CNI_Policy" {
      ~ id         = "eks-node-group-thodung-vntechies-demo-eks-20230714145948148500000005" -> (known after apply)
      ~ role       = "eks-node-group-thodung-vntechies-demo-eks" -> "eks-node-group-cloud-day-demo-demo-eks" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.AmazonSSMManagedInstanceCore must be replaced
-/+ resource "aws_iam_role_policy_attachment" "AmazonSSMManagedInstanceCore" {
      ~ id         = "eks-node-group-thodung-vntechies-demo-eks-20230714145947863900000001" -> (known after apply)
      ~ role       = "eks-node-group-thodung-vntechies-demo-eks" -> "eks-node-group-cloud-day-demo-demo-eks" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.irsa_ebs_csi_policy["aws-ebs-csi-driver"] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "irsa_ebs_csi_policy" {
      ~ id         = "aws-ebs-csi-driver-2023071415072141720000000a" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::010352592457:policy/thodung-vntechies-demo-eks-ebs-csi" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.vpc["demo-vpc"].aws_internet_gateway.igw[0] will be updated in-place
  ~ resource "aws_internet_gateway" "igw" {
        id       = "igw-0d474349bd636d68c"
      ~ tags     = {
          ~ "Name"        = "thodung-vntechies-igw-demo-vpc" -> "cloud-day-demo-igw-demo-vpc"
          - "component"   = "thodung" -> null
          - "env"         = "vntechies" -> null
          - "github_repo" = "github.com/vntechies/013-demo-gitops" -> null
          - "project"     = "013-demo-gitops" -> null
        }
      ~ tags_all = {
          ~ "Name"        = "thodung-vntechies-igw-demo-vpc" -> "cloud-day-demo-igw-demo-vpc"
          ~ "component"   = "thodung" -> "cloud-day"
          ~ "env"         = "vntechies" -> "demo"
          ~ "github_repo" = "github.com/vntechies/013-demo-gitops" -> "github.com/tnx-journey-to-cloud/demo-aws-cloudday-vn"
          ~ "project"     = "013-demo-gitops" -> "demo-aws-cloudday-vn"
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc["demo-vpc"].aws_route_table.this["public_rtb"] will be updated in-place
  ~ resource "aws_route_table" "this" {
        id               = "rtb-01d240c02fb6f1f20"
      ~ tags             = {
          ~ "Name"        = "thodung-vntechies-rtb-demo-vpc-public-rtb" -> "cloud-day-demo-rtb-demo-vpc-public-rtb"
          - "component"   = "thodung" -> null
          - "env"         = "vntechies" -> null
          - "github_repo" = "github.com/vntechies/013-demo-gitops" -> null
          - "project"     = "013-demo-gitops" -> null
        }
      ~ tags_all         = {
          ~ "Name"        = "thodung-vntechies-rtb-demo-vpc-public-rtb" -> "cloud-day-demo-rtb-demo-vpc-public-rtb"
          ~ "component"   = "thodung" -> "cloud-day"
          ~ "env"         = "vntechies" -> "demo"
          ~ "github_repo" = "github.com/vntechies/013-demo-gitops" -> "github.com/tnx-journey-to-cloud/demo-aws-cloudday-vn"
          ~ "project"     = "013-demo-gitops" -> "demo-aws-cloudday-vn"
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc["demo-vpc"].aws_route_table_association.this["public_subnet4"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = "rtb-01d240c02fb6f1f20"
      + subnet_id      = (known after apply)
    }

  # module.vpc["demo-vpc"].aws_security_group.endpoint will be updated in-place
  ~ resource "aws_security_group" "endpoint" {
        id                     = "sg-0618aee9155004a34"
        name                   = "terraform-20230624053731112800000001"
      ~ tags                   = {
          ~ "Name"        = "thodung-vntechies-sg-vpce-ap-southeast-1" -> "cloud-day-demo-sg-vpce-ap-southeast-1"
          - "component"   = "thodung" -> null
          - "env"         = "vntechies" -> null
          - "github_repo" = "github.com/vntechies/013-demo-gitops" -> null
          - "project"     = "013-demo-gitops" -> null
        }
      ~ tags_all               = {
          ~ "Name"        = "thodung-vntechies-sg-vpce-ap-southeast-1" -> "cloud-day-demo-sg-vpce-ap-southeast-1"
          ~ "component"   = "thodung" -> "cloud-day"
          ~ "env"         = "vntechies" -> "demo"
          ~ "github_repo" = "github.com/vntechies/013-demo-gitops" -> "github.com/tnx-journey-to-cloud/demo-aws-cloudday-vn"
          ~ "project"     = "013-demo-gitops" -> "demo-aws-cloudday-vn"
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc["demo-vpc"].aws_subnet.this["public_subnet1"] will be updated in-place
  ~ resource "aws_subnet" "this" {
        id                                             = "subnet-0cb7fc68240103b1b"
      ~ tags                                           = {
          ~ "Name"                                              = "thodung-vntechies-public_subnet1-ap-southeast-1a" -> "cloud-day-demo-public_subnet1-ap-southeast-1a"
          - "component"                                         = "thodung" -> null
          - "env"                                               = "vntechies" -> null
          - "github_repo"                                       = "github.com/vntechies/013-demo-gitops" -> null
            "group"                                             = "public_subnet"
          + "kubernetes.io/cluster/cloud-day-demo-eks-demo-eks" = "shared"
            "kubernetes.io/role/elb"                            = "1"
          - "project"                                           = "013-demo-gitops" -> null
            "public_subnet1"                                    = "ap-southeast-1a"
        }
      ~ tags_all                                       = {
          ~ "Name"                                              = "thodung-vntechies-public_subnet1-ap-southeast-1a" -> "cloud-day-demo-public_subnet1-ap-southeast-1a"
          ~ "component"                                         = "thodung" -> "cloud-day"
          ~ "env"                                               = "vntechies" -> "demo"
          ~ "github_repo"                                       = "github.com/vntechies/013-demo-gitops" -> "github.com/tnx-journey-to-cloud/demo-aws-cloudday-vn"
          + "kubernetes.io/cluster/cloud-day-demo-eks-demo-eks" = "shared"
          ~ "project"                                           = "013-demo-gitops" -> "demo-aws-cloudday-vn"
            # (3 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc["demo-vpc"].aws_subnet.this["public_subnet2"] will be updated in-place
  ~ resource "aws_subnet" "this" {
        id                                             = "subnet-01183ba54fce29ae7"
      ~ tags                                           = {
          ~ "Name"                                              = "thodung-vntechies-public_subnet2-ap-southeast-1b" -> "cloud-day-demo-public_subnet2-ap-southeast-1b"
          - "component"                                         = "thodung" -> null
          - "env"                                               = "vntechies" -> null
          - "github_repo"                                       = "github.com/vntechies/013-demo-gitops" -> null
            "group"                                             = "public_subnet"
          + "kubernetes.io/cluster/cloud-day-demo-eks-demo-eks" = "shared"
            "kubernetes.io/role/elb"                            = "1"
          - "project"                                           = "013-demo-gitops" -> null
            "public_subnet2"                                    = "ap-southeast-1b"
        }
      ~ tags_all                                       = {
          ~ "Name"                                              = "thodung-vntechies-public_subnet2-ap-southeast-1b" -> "cloud-day-demo-public_subnet2-ap-southeast-1b"
          ~ "component"                                         = "thodung" -> "cloud-day"
          ~ "env"                                               = "vntechies" -> "demo"
          ~ "github_repo"                                       = "github.com/vntechies/013-demo-gitops" -> "github.com/tnx-journey-to-cloud/demo-aws-cloudday-vn"
          + "kubernetes.io/cluster/cloud-day-demo-eks-demo-eks" = "shared"
          ~ "project"                                           = "013-demo-gitops" -> "demo-aws-cloudday-vn"
            # (3 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc["demo-vpc"].aws_subnet.this["public_subnet3"] will be updated in-place
  ~ resource "aws_subnet" "this" {
        id                                             = "subnet-0b1743b318f3693ee"
      ~ tags                                           = {
          ~ "Name"                                              = "thodung-vntechies-public_subnet3-ap-southeast-1c" -> "cloud-day-demo-public_subnet3-ap-southeast-1c"
          - "component"                                         = "thodung" -> null
          - "env"                                               = "vntechies" -> null
          - "github_repo"                                       = "github.com/vntechies/013-demo-gitops" -> null
            "group"                                             = "public_subnet"
          + "kubernetes.io/cluster/cloud-day-demo-eks-demo-eks" = "shared"
            "kubernetes.io/role/elb"                            = "1"
          - "project"                                           = "013-demo-gitops" -> null
            "public_subnet3"                                    = "ap-southeast-1c"
        }
      ~ tags_all                                       = {
          ~ "Name"                                              = "thodung-vntechies-public_subnet3-ap-southeast-1c" -> "cloud-day-demo-public_subnet3-ap-southeast-1c"
          ~ "component"                                         = "thodung" -> "cloud-day"
          ~ "env"                                               = "vntechies" -> "demo"
          ~ "github_repo"                                       = "github.com/vntechies/013-demo-gitops" -> "github.com/tnx-journey-to-cloud/demo-aws-cloudday-vn"
          + "kubernetes.io/cluster/cloud-day-demo-eks-demo-eks" = "shared"
          ~ "project"                                           = "013-demo-gitops" -> "demo-aws-cloudday-vn"
            # (3 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

  # module.vpc["demo-vpc"].aws_subnet.this["public_subnet4"] will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                              = "cloud-day-demo-public_subnet4-ap-southeast-1a"
          + "group"                                             = "public_subnet"
          + "kubernetes.io/cluster/cloud-day-demo-eks-demo-eks" = "shared"
          + "kubernetes.io/role/elb"                            = "1"
          + "public_subnet3"                                    = "ap-southeast-1a"
        }
      + tags_all                                       = {
          + "Name"                                              = "cloud-day-demo-public_subnet4-ap-southeast-1a"
          + "component"                                         = "cloud-day"
          + "env"                                               = "demo"
          + "github_repo"                                       = "github.com/tnx-journey-to-cloud/demo-aws-cloudday-vn"
          + "group"                                             = "public_subnet"
          + "kubernetes.io/cluster/cloud-day-demo-eks-demo-eks" = "shared"
          + "kubernetes.io/role/elb"                            = "1"
          + "project"                                           = "demo-aws-cloudday-vn"
          + "public_subnet3"                                    = "ap-southeast-1a"
        }
      + vpc_id                                         = "vpc-05f67dec3e19597d3"
    }

  # module.vpc["demo-vpc"].aws_vpc.vpc will be updated in-place
  ~ resource "aws_vpc" "vpc" {
        id                                   = "vpc-05f67dec3e19597d3"
      ~ tags                                 = {
          ~ "Name"                                              = "thodung-vntechies-vpc-demo-vpc" -> "cloud-day-demo-vpc-demo-vpc"
          - "component"                                         = "thodung" -> null
          - "env"                                               = "vntechies" -> null
          - "github_repo"                                       = "github.com/vntechies/013-demo-gitops" -> null
          + "kubernetes.io/cluster/cloud-day-demo-eks-demo-eks" = "shared"
          - "project"                                           = "013-demo-gitops" -> null
        }
      ~ tags_all                             = {
          ~ "Name"                                              = "thodung-vntechies-vpc-demo-vpc" -> "cloud-day-demo-vpc-demo-vpc"
          ~ "component"                                         = "thodung" -> "cloud-day"
          ~ "env"                                               = "vntechies" -> "demo"
          ~ "github_repo"                                       = "github.com/vntechies/013-demo-gitops" -> "github.com/tnx-journey-to-cloud/demo-aws-cloudday-vn"
          + "kubernetes.io/cluster/cloud-day-demo-eks-demo-eks" = "shared"
          ~ "project"                                           = "013-demo-gitops" -> "demo-aws-cloudday-vn"
        }
        # (16 unchanged attributes hidden)
    }

  # module.vpc["demo-vpc"].aws_vpc_endpoint.dynamodb will be updated in-place
  ~ resource "aws_vpc_endpoint" "dynamodb" {
        id                    = "vpce-0c819eb8e77498f45"
      ~ tags                  = {
          ~ "Name"        = "thodung-vntechies-s3-gwendpoint-ap-southeast-1" -> "cloud-day-demo-s3-gwendpoint-ap-southeast-1"
          - "component"   = "thodung" -> null
          - "env"         = "vntechies" -> null
          - "github_repo" = "github.com/vntechies/013-demo-gitops" -> null
          - "project"     = "013-demo-gitops" -> null
        }
      ~ tags_all              = {
          ~ "Name"        = "thodung-vntechies-s3-gwendpoint-ap-southeast-1" -> "cloud-day-demo-s3-gwendpoint-ap-southeast-1"
          ~ "component"   = "thodung" -> "cloud-day"
          ~ "env"         = "vntechies" -> "demo"
          ~ "github_repo" = "github.com/vntechies/013-demo-gitops" -> "github.com/tnx-journey-to-cloud/demo-aws-cloudday-vn"
          ~ "project"     = "013-demo-gitops" -> "demo-aws-cloudday-vn"
        }
        # (16 unchanged attributes hidden)
    }

  # module.vpc["demo-vpc"].aws_vpc_endpoint.s3 will be updated in-place
  ~ resource "aws_vpc_endpoint" "s3" {
        id                    = "vpce-05ecb02e9d23abbee"
      ~ tags                  = {
          ~ "Name"        = "thodung-vntechies-s3-gwendpoint-ap-southeast-1" -> "cloud-day-demo-s3-gwendpoint-ap-southeast-1"
          - "component"   = "thodung" -> null
          - "env"         = "vntechies" -> null
          - "github_repo" = "github.com/vntechies/013-demo-gitops" -> null
          - "project"     = "013-demo-gitops" -> null
        }
      ~ tags_all              = {
          ~ "Name"        = "thodung-vntechies-s3-gwendpoint-ap-southeast-1" -> "cloud-day-demo-s3-gwendpoint-ap-southeast-1"
          ~ "component"   = "thodung" -> "cloud-day"
          ~ "env"         = "vntechies" -> "demo"
          ~ "github_repo" = "github.com/vntechies/013-demo-gitops" -> "github.com/tnx-journey-to-cloud/demo-aws-cloudday-vn"
          ~ "project"     = "013-demo-gitops" -> "demo-aws-cloudday-vn"
        }
        # (16 unchanged attributes hidden)
    }

Plan: 17 to add, 10 to change, 15 to destroy.

Changes to Outputs:
  ~ aws_iam_openid_connect_provider_arn = "arn:aws:iam::010352592457:oidc-provider/oidc.eks.ap-southeast-1.amazonaws.com/id/1E420E5E377EF7A7868356CCBB541B6D" -> (known after apply)
  ~ eks_cluster_arn                     = "arn:aws:eks:ap-southeast-1:010352592457:cluster/thodung-vntechies-eks-demo-eks" -> (known after apply)
  ~ eks_cluster_endpoint                = "https://1E420E5E377EF7A7868356CCBB541B6D.gr7.ap-southeast-1.eks.amazonaws.com" -> (known after apply)
  ~ eks_cluster_id                      = "thodung-vntechies-eks-demo-eks" -> (known after apply)
  ~ eks_cluster_name                    = "thodung-vntechies-eks-demo-eks" -> "cloud-day-demo-eks-demo-eks"
  ~ subnet_ids                          = {
      ~ demo-vpc = {
          + public_subnet4 = (known after apply)
            # (3 unchanged attributes hidden)
        }
    }
╷
│ Error: Get "http://localhost/api/v1/namespaces/kube-system/configmaps/aws-auth": dial tcp 127.0.0.1:80: connect: connection refused
│ 
│   with module.eks.kubernetes_config_map_v1_data.aws_auth[0],
│   on .terraform/modules/eks/main.tf line 76, in resource "kubernetes_config_map_v1_data" "aws_auth":
│   76: resource "kubernetes_config_map_v1_data" "aws_auth" {
│ 
╵

```
</details>